# GetUseWallClosure

## Description
Gets the use wall closure setting of a symbol definition, plug-in object style, or plug-in object.

```pascal
FUNCTION GetUseWallClosure(hObject : HANDLE) : BOOLEAN;
```

```python

def vs.GetUseWallClosure(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|The symbol definition, plug-in object style, or plug-in object.|

## Returns
The use wall closure setting of the symbol definition, plug-in object style, or plug-in object.

## See Also
VS Functions:
SetUseWallClosure

## Version
Availability: from Vectorworks 2022
## Category
* Objects - Custom